; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	spectrograph0 - mode
	spectrograph4 - mode
	image1 - mode
	spectrograph2 - mode
	image3 - mode
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	Star2 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star2)
	(supports instrument4 image3)
	(supports instrument4 spectrograph4)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph4)
	(supports instrument7 spectrograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star3)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument9 spectrograph0)
	(supports instrument9 image3)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star4)
	(calibration_target instrument9 Star3)
	(supports instrument10 spectrograph0)
	(supports instrument10 image3)
	(calibration_target instrument10 GroundStation5)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument11 spectrograph0)
	(supports instrument11 spectrograph4)
	(supports instrument11 image1)
	(calibration_target instrument11 Star2)
	(calibration_target instrument11 GroundStation0)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet7)
)
(:goal (and
	(pointing satellite1 Planet7)
	(pointing satellite3 Star11)
	(pointing satellite4 Star6)
	(have_image Star6 spectrograph4)
	(have_image Planet7 spectrograph4)
	(have_image Star8 spectrograph2)
	(have_image Star9 image3)
	(have_image Star10 spectrograph2)
	(have_image Star11 spectrograph2)
))

)

; plan
1. (turn_to satellite4 star6 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star6)
   goals met: 1 of 9
2. (turn_to satellite3 star11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star11)
   goals met: 2 of 9
3. (turn_to satellite1 groundstation1 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation1)
   goals met: 2 of 9
4. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 9
5. (calibrate satellite1 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 2 of 9
6. (turn_to satellite1 star11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star11)
   goals met: 2 of 9
7. (take_image satellite1 star11 instrument4 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 3 of 9
8. (turn_to satellite1 star10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star10)
   goals met: 3 of 9
9. (take_image satellite1 star10 instrument4 spectrograph2)
   added: (have_image star10 spectrograph2)
   goals met: 4 of 9
10. (turn_to satellite1 star6 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star6)
   goals met: 4 of 9
11. (take_image satellite1 star6 instrument4 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 5 of 9
12. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   goals met: 5 of 9
13. (take_image satellite1 star8 instrument4 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 6 of 9
14. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 6 of 9
15. (take_image satellite1 star9 instrument4 image3)
   added: (have_image star9 image3)
   goals met: 7 of 9
16. (turn_to satellite1 planet7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet7)
   goals met: 8 of 9
17. (take_image satellite1 planet7 instrument4 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 9 of 9
